#+TITLE: Mitigation Manager

This project contains all the necessary resources to build and deploy the
Mitigation Manager on the ResilMesh network.

# TODO An idea I had is that we could build out our own attack graphs based on
# the network events.  I don't know how much "attack mitigation" this is as
# opposed to detection/forensics/etc, but it's definitely related to choosing
# the appropriate mitigations.  I also don't know how useful this'd be, or how
# feasible (since I don't really have a good idea of what the alert traffic is
# going to look like), but it's an interesting approach.  For example: say that
# X attack happens, then Y, and that's followed by Z.  Perhaps X-Y-Z doesn't
# match any of our predefined attack graphs, but we can store this "mini attack
# graph" and use it in the future when we detect X-Y to prevent Z in advance.

# TODO There's two types of alerts: attacks (i.e. "this malicious file has been
# downloaded") and attack preconditions (i.e. "This device connected to IP
# a.b.c.d").  Attacks are what (potentially) trigger an update to the current
# threat state, attack preconditions are what are used to potentially predict an
# attack coming in soon.

# TODO There's something to be said about MITRE tactics.  When receiving alerts
# with MITRE ATT&CK IDs associated with them, we use them to update the current
# state and build attack graphs.  However, other than by checking against
# preexisting hand crafted (AI generated?) graphs, there's no real way to tell
# if MITRE ID A happened because of MITRE ID B, and is thus the next node in a
# graph.  Tactics are already associated to attacks, and can be used to predict
# what will happen next.  For example, file permission modification is
# associated with defense evation.  Tactics are few, so we could reasonably
# build manual tactic graphs that represent the ordered steps attackers will
# take.  For example: once an attacker has gained initial access (TA0001), they
** Variables

#+NAME: mitigation-manager-port
#+begin_src emacs-lisp :cache yes
  "8333"
#+end_src

#+RESULTS[9f7b03a3714ec7fd9ea2e346a74ea044c02dbc97]: mitigation-manager-port
: 8333

#+NAME: example-rule-100002
#+begin_src python :session :results verbatim
  """
  {
    "timestamp": "2024-10-22T09:31:15.007+0000",
    "rule": {
      "level": 14,
      "description": "Connection via ncat from source port 11234 to 192.168.200.1:36210. PID: 3613",
      "id": "100002",
      "mitre": {
        "id": [
          "T1041",
          "T1219"
        ],
        "tactic": [
          "Exfiltration",
          "Command and Control"
        ],
        "technique": [
          "Exfiltration Over C2 Channel",
          "Remote Access Software"
        ]
      },
      "firedtimes": 1,
      "mail": true,
      "groups": [
        "established_conn"
      ]
    },
    "agent": {
      "id": "001",
      "name": "eeb0036baf28",
      "ip": "192.168.200.200"
    },
    "manager": {
      "name": "wazuh.manager"
    },
    "id": "1729589475.25117",
    "full_log": "ncat 3613 848a20e98d52:11234->192.168.200.1:36210",
    "decoder": {
      "name": "lsof_ncat_decoder"
    },
    "data": {
      "pid": "3613",
      "src_port": "11234",
      "dst_ip": "192.168.200.1",
      "dst_port": "36210"
    },
    "location": "command_ncat_conn"
  }
  """
#+end_src

#+NAME: example-rule-100003
#+begin_src python :session :results verbatim
  """
  {
    "timestamp": "2024-10-22T09:18:46.153+0000",
    "rule": {
      "level": 8,
      "description": "Execute permission added to python script.",
      "id": "100003",
      "mitre": {
        "id": [
          "T1222.002"
        ],
        "tactic": [
          "Defense Evasion"
        ],
        "technique": [
          "Linux and Mac File and Directory Permissions Modification"
        ]
      },
      "firedtimes": 4,
      "mail": false,
      "groups": [
        "syscheck"
      ]
    },
    "agent": {
      "id": "001",
      "name": "eeb0036baf28",
      "ip": "192.168.200.200"
    },
    "manager": {
      "name": "wazuh.manager"
    },
    "id": "1729588726.22091",
    "full_log": "File '/tmp/zerologon_tester.py' modified\nMode: realtime\nChanged attributes: permission\nPermissions changed from 'rw-r--r--' to 'rwxr-xr-x'\n",
    "syscheck": {
      "path": "/tmp/zerologon_tester.py",
      "mode": "realtime",
      "size_after": "3041",
      "perm_before": "rw-r--r--",
      "perm_after": "rwxr-xr-x",
      "uid_after": "0",
      "gid_after": "0",
      "md5_after": "0008432c27c43f9fe58e9bf191f9c6cf",
      "sha1_after": "84dc56d99268f70619532536f8445f56609547c7",
      "sha256_after": "b8ae48c2e46c28f1004e006348af557c7d912036b9ead88be67bca2bafde01d3",
      "uname_after": "root",
      "gname_after": "root",
      "mtime_after": "2024-10-22T09:16:02",
      "inode_after": 151477998,
      "changed_attributes": [
        "permission"
      ],
      "event": "modified"
    },
    "decoder": {
      "name": "syscheck_integrity_changed"
    },
    "location": "syscheck"
  }
  """
#+end_src

#+NAME: example-rule-100004
#+begin_src python :session :results verbatim
  """
  {
    "timestamp": "2024-10-22T09:25:39.991+0000",
    "rule": {
      "level": 8,
      "description": "Executable file added to filesystem",
      "id": "100004",
      "mitre": {
        "id": [
          "T1204.002"
        ],
        "tactic": [
          "Execution"
        ],
        "technique": [
          "Malicious File"
        ]
      },
      "firedtimes": 8,
      "mail": false,
      "groups": [
        "filesystem"
      ]
    },
    "agent": {
      "id": "001",
      "name": "eeb0036baf28",
      "ip": "192.168.200.200"
    },
    "manager": {
      "name": "wazuh.manager"
    },
    "id": "1729589139.24598",
    "full_log": "File '/tmp/zerologon_tester.py' added\nMode: realtime\n",
    "syscheck": {
      "path": "/tmp/zerologon_tester.py",
      "mode": "realtime",
      "size_after": "3041",
      "perm_after": "rw-r--r--",
      "uid_after": "0",
      "gid_after": "0",
      "md5_after": "0008432c27c43f9fe58e9bf191f9c6cf",
      "sha1_after": "84dc56d99268f70619532536f8445f56609547c7",
      "sha256_after": "b8ae48c2e46c28f1004e006348af557c7d912036b9ead88be67bca2bafde01d3",
      "uname_after": "root",
      "gname_after": "root",
      "mtime_after": "2024-10-22T09:25:39",
      "inode_after": 151477998,
      "event": "added"
    },
    "decoder": {
      "name": "syscheck_new_entry"
    },
    "location": "syscheck"
  }
  """
#+end_src

